[
  {
    "Planet": "Mercury",
    "Color": "#aaaaaa",
    "Mass (10^24kg)": 0.33,
    "Diameter (km)": 4879,
    "Density (kg/m^3)": 5429,
    "Surface Gravity(m/s^2)": 3.7,
    "Escape Velocity (km/s)": 4.3,
    "Rotation Period (hours)": 1407.6,
    "Length of Day (hours)": 4222.6,
    "Distance from Sun (10^6 km)": 57.9,
    "Perihelion (10^6 km)": 46,
    "Aphelion (10^6 km)": 69.8,
    "Orbital Period (days)": 88,
    "Orbital Velocity (km/s)": 47.4,
    "Orbital Inclination (degrees)": 7,
    "Orbital Eccentricity": 0.206,
    "Obliquity to Orbit (degrees)": 0.034,
    "Mean Temperature (C)": 167,
    "Surface Pressure (bars)": 0,
    "Number of Moons": 0,
    "Ring System?": "No",
    "Global Magnetic Field?": "Yes",
    "Description": "Mercury is the smallest planet in the Solar System and the closest to the Sun. In English, it is named after the ancient Roman god Mercurius (Mercury), god of commerce and communication, and the messenger of the gods. Mercury is classified as a terrestrial planet, with roughly the same surface gravity as Mars. It has no moons and no rings. Mercury has a very thin atmosphere consisting mainly of oxygen (O2), sodium (Na), hydrogen (H2), helium (He), and potassium (K). Mercury, despite being the smallest planet, boasts some extreme temperature variations. During the day, temperatures can soar to around 430°C (800°F) due to its proximity to the Sun, hot enough to melt lead. However, because Mercury has virtually no atmosphere to trap heat, its surface cools rapidly at night, plummeting to around -180°C (-290°F).",
    "Image": "images/Mercury.png"
  },
  {
    "Planet": "Venus",
    "Color": "#e1b03b",
    "Mass (10^24kg)": 4.87,
    "Diameter (km)": 12104,
    "Density (kg/m^3)": 5243,
    "Surface Gravity(m/s^2)": 8.9,
    "Escape Velocity (km/s)": 10.4,
    "Rotation Period (hours)": -5832.5,
    "Length of Day (hours)": 2802,
    "Distance from Sun (10^6 km)": 108.2,
    "Perihelion (10^6 km)": 107.5,
    "Aphelion (10^6 km)": 108.9,
    "Orbital Period (days)": 224.7,
    "Orbital Velocity (km/s)": 35,
    "Orbital Inclination (degrees)": 3.4,
    "Orbital Eccentricity": 0.007,
    "Obliquity to Orbit (degrees)": 177.4,
    "Mean Temperature (C)": 464,
    "Surface Pressure (bars)": 92,
    "Number of Moons": 0,
    "Ring System?": "No",
    "Global Magnetic Field?": "No",
    "Description": "Venus is the second planet from the Sun. It is a terrestrial planet and is the closest in mass and size to its orbital neighbour Earth. Venus is notable for having the densest atmosphere of the terrestrial planets, composed mostly of carbon dioxide with a thick, global sulfuric acid cloud cover.Venus, often referred to as Earth's 'sister planet' due to their similar size and composition, presents a stark contrast to its terrestrial neighbor. While Earth is lush and habitable, Venus is a hostile and inhospitable world.One of the most striking features of Venus is its extreme greenhouse effect. The planet's thick atmosphere traps heat from the Sun, resulting in surface temperatures that can reach a scorching 465°C (869°F) – hot enough to melt lead. This makes Venus the hottest planet in our solar system, even hotter than Mercury, despite being farther from the Sun.",
    "Image": "images/Venus.png"
  },
  {
    "Planet": "Earth",
    "Color": "#6fcbf7",
    "Mass (10^24kg)": 5.97,
    "Diameter (km)": 12756,
    "Density (kg/m^3)": 5514,
    "Surface Gravity(m/s^2)": 9.8,
    "Escape Velocity (km/s)": 11.2,
    "Rotation Period (hours)": 23.9,
    "Length of Day (hours)": 24,
    "Distance from Sun (10^6 km)": 149.6,
    "Perihelion (10^6 km)": 147.1,
    "Aphelion (10^6 km)": 152.1,
    "Orbital Period (days)": 365.2,
    "Orbital Velocity (km/s)": 29.8,
    "Orbital Inclination (degrees)": 0,
    "Orbital Eccentricity": 0.017,
    "Obliquity to Orbit (degrees)": 23.4,
    "Mean Temperature (C)": 15,
    "Surface Pressure (bars)": 1,
    "Number of Moons": 1,
    "Ring System?": "No",
    "Global Magnetic Field?": "Yes",
    "Description": "Earth is the third planet from the Sun and the only known planet to support life. It has one moon and no rings. Earth's atmosphere is predominantly nitrogen (N2) and oxygen (O2), with trace amounts of other gases, and its surface is covered mostly by water (H2O). Earth, our home planet, is a dynamic and diverse world teeming with life. It occupies a unique position in the solar system, situated just at the right distance from the Sun to maintain a stable climate conducive to life as we know it. One of the defining features of Earth is its abundance of water. Approximately 71% of the planet's surface is covered by oceans, which play a critical role in regulating the climate, supporting ecosystems, and sustaining life. The presence of liquid water is a key factor that sets Earth apart from other planets in our solar system and is essential for the existence of life as we know it.",
    "Image": "images/Earth.png"
  },
  {
    "Planet": "Mars",
    "Color": "#c1440e",
    "Mass (10^24kg)": 0.642,
    "Diameter (km)": 6792,
    "Density (kg/m^3)": 3934,
    "Surface Gravity(m/s^2)": 3.7,
    "Escape Velocity (km/s)": 5,
    "Rotation Period (hours)": 24.6,
    "Length of Day (hours)": 24.7,
    "Distance from Sun (10^6 km)": 228,
    "Perihelion (10^6 km)": 206.7,
    "Aphelion (10^6 km)": 249.3,
    "Orbital Period (days)": 687,
    "Orbital Velocity (km/s)": 24.1,
    "Orbital Inclination (degrees)": 1.8,
    "Orbital Eccentricity": 0.094,
    "Obliquity to Orbit (degrees)": 25.2,
    "Mean Temperature (C)": -65,
    "Surface Pressure (bars)": 0.01,
    "Number of Moons": 2,
    "Ring System?": "No",
    "Global Magnetic Field?": "No",
    "Description": "Mars, often referred to as the 'Red Planet' due to its distinctive reddish hue, has long captured the imagination of scientists and explorers alike. Mars is the fourth planet from the Sun. It has two moons, Phobos and Deimos, and no rings. Mars has a thin atmosphere primarily composed of carbon dioxide (CO2) and its surface shows evidence of past water flow. As the fourth planet from the Sun, Mars occupies a crucial position in the solar system, situated between Earth and the outer gas giants. One of the most striking features of Mars is its rugged and desolate landscape, characterized by vast plains, towering volcanoes, deep canyons, and ancient riverbeds. The planet's surface bears the scars of its turbulent geological history, including evidence of volcanic activity, impact craters, and erosion caused by wind and water.",
    "Image": "images/Mars.png"
  },
  {
    "Planet": "Jupiter",
    "Color": "#d59a6f",
    "Mass (10^24kg)": 1898,
    "Diameter (km)": 142984,
    "Density (kg/m^3)": 1326,
    "Surface Gravity(m/s^2)": 23.1,
    "Escape Velocity (km/s)": 59.5,
    "Rotation Period (hours)": 9.9,
    "Length of Day (hours)": 9.9,
    "Distance from Sun (10^6 km)": 778.5,
    "Perihelion (10^6 km)": 740.6,
    "Aphelion (10^6 km)": 816.4,
    "Orbital Period (days)": 4331,
    "Orbital Velocity (km/s)": 13.1,
    "Orbital Inclination (degrees)": 1.3,
    "Orbital Eccentricity": 0.049,
    "Obliquity to Orbit (degrees)": 3.1,
    "Mean Temperature (C)": -110,
    "Surface Pressure (bars)": "Unknown",
    "Number of Moons": 79,
    "Ring System?": "Yes",
    "Global Magnetic Field?": "Yes",
    "Description": "Jupiter, often hailed as the 'King of the Planets', is the largest and most massive planet in our solar system. Its colossal size and immense gravitational influence have shaped the dynamics of the entire planetary system, earning it a central role in the cosmic symphony of celestial bodies. Composed primarily of hydrogen (H2) and helium (He), Jupiter resembles a miniature version of the Sun in many respects, with a composition that closely mirrors that of a stellar body. Despite its gaseous nature, Jupiter boasts a complex and dynamic atmosphere, characterized by swirling cloud bands, massive storms, and atmospheric phenomena unlike anything found on Earth. One of the most iconic features of Jupiter's atmosphere is the Great Red Spot, a colossal storm system that has raged for centuries. This giant anticyclonic storm, which is larger than Earth itself, creates a swirling vortex of gases that is visible even from telescopes on Earth. The exact mechanism behind the formation and persistence of the Great Red Spot remains a topic of ongoing scientific inquiry.",
    "Image": "images/Jupiter.png"
  },
  {
    "Planet": "Saturn",
    "Color": "#f8d19f",
    "Mass (10^24kg)": 568,
    "Diameter (km)": 120536,
    "Density (kg/m^3)": 687,
    "Surface Gravity(m/s^2)": 9,
    "Escape Velocity (km/s)": 35.5,
    "Rotation Period (hours)": 10.7,
    "Length of Day (hours)": 10.7,
    "Distance from Sun (10^6 km)": 1432,
    "Perihelion (10^6 km)": 1357.6,
    "Aphelion (10^6 km)": 1506.5,
    "Orbital Period (days)": 10747,
    "Orbital Velocity (km/s)": 9.7,
    "Orbital Inclination (degrees)": 2.5,
    "Orbital Eccentricity": 0.052,
    "Obliquity to Orbit (degrees)": 26.7,
    "Mean Temperature (C)": -140,
    "Surface Pressure (bars)": "Unknown",
    "Number of Moons": 82,
    "Ring System?": "Yes",
    "Global Magnetic Field?": "Yes",
    "Description": "Saturn, often referred to as the 'Ringed Planet', is one of the most iconic and visually stunning celestial bodies in our solar system. Its spectacular ring system, consisting of nine continuous main rings and three discontinuous arcs, is a defining feature that has captivated astronomers and skywatchers for centuries. These rings, made up of countless icy particles ranging in size from tiny grains to large boulders, form a dazzling band of light encircling Saturn's equator. While they appear solid from a distance, the rings are actually composed of countless individual particles orbiting the planet under the influence of its gravitational pull. In addition to its magnificent rings, Saturn boasts a diverse and extensive moon system, with a total of 82 confirmed moons and numerous additional moonlets awaiting official confirmation. Among Saturn's moons, Titan stands out as the largest and most intriguing. This enigmatic moon, larger than the planet Mercury, is shrouded in a thick atmosphere of nitrogen and methane, concealing a complex landscape of rivers, lakes, and mountains.",
    "Image": "images/Saturnx.png"
  },
  {
    "Planet": "Uranus",
    "Color": "#93d7d4",
    "Mass (10^24kg)": 86.8,
    "Diameter (km)": 51118,
    "Density (kg/m^3)": 1270,
    "Surface Gravity(m/s^2)": 8.7,
    "Escape Velocity (km/s)": 21.3,
    "Rotation Period (hours)": -17.2,
    "Length of Day (hours)": 17.2,
    "Distance from Sun (10^6 km)": 2867,
    "Perihelion (10^6 km)": 2732.7,
    "Aphelion (10^6 km)": 3001.4,
    "Orbital Period (days)": 30589,
    "Orbital Velocity (km/s)": 6.8,
    "Orbital Inclination (degrees)": 0.8,
    "Orbital Eccentricity": 0.047,
    "Obliquity to Orbit (degrees)": 97.8,
    "Mean Temperature (C)": -195,
    "Surface Pressure (bars)": "Unknown",
    "Number of Moons": 27,
    "Ring System?": "Yes",
    "Global Magnetic Field?": "Yes",
    "Description": "Uranus, the seventh planet from the Sun, is a fascinating and enigmatic world that stands out for several unique features. Unlike most planets in our solar system, Uranus rotates on its side, with its axis of rotation tilted nearly parallel to its orbital plane. This extreme axial tilt gives Uranus its distinctive 'rolling' motion as it orbits the Sun, causing its poles to experience alternating periods of sunlight and darkness during its 84-year-long orbit.Composed primarily of ice and rock, Uranus is classified as an ice giant, similar to its outer neighbor Neptune. Its atmosphere consists mainly of hydrogen (H2), helium (He), and methane (CH4), which gives it a bluish-green hue. The presence of methane in Uranus' atmosphere absorbs red light, reflecting blue and green wavelengths back into space, resulting in its characteristic color. Uranus possesses a faint ring system, first discovered in 1977 during a stellar occultation event. Unlike the more prominent ring systems of Saturn or Jupiter, Uranus' rings are relatively dark and composed of small particles, likely consisting of water ice and organic compounds. The origin of Uranus' rings remains a subject of ongoing research, with theories suggesting that they may be the result of collisions between moons or the remnants of ancient moons torn apart by tidal forces.",
    "Image": "images/Uranus.png"
  },
  {
    "Planet": "Neptune",
    "Color": "#4063D8",
    "Mass (10^24kg)": 102,
    "Diameter (km)": 49528,
    "Density (kg/m^3)": 1638,
    "Surface Gravity(m/s^2)": 11,
    "Escape Velocity (km/s)": 23.5,
    "Rotation Period (hours)": 16.1,
    "Length of Day (hours)": 16.1,
    "Distance from Sun (10^6 km)": 4515,
    "Perihelion (10^6 km)": 4471.1,
    "Aphelion (10^6 km)": 4558.9,
    "Orbital Period (days)": 59800,
    "Orbital Velocity (km/s)": 5.4,
    "Orbital Inclination (degrees)": 1.8,
    "Orbital Eccentricity": 0.01,
    "Obliquity to Orbit (degrees)": 28.3,
    "Mean Temperature (C)": -200,
    "Surface Pressure (bars)": "Unknown",
    "Number of Moons": 14,
    "Ring System?": "Yes",
    "Global Magnetic Field?": "Yes",
    "Description": "Neptune, the eighth and most distant planet in our solar system, is a fascinating world shrouded in mystery and intrigue. Named after the Roman god of the sea, Neptune's deep blue hue evokes its association with the vastness of the ocean. Composed primarily of hydrogen (H2), helium (He), and methane (CH4), Neptune is classified as an ice giant, similar to its sibling Uranus. However, unlike Uranus, which has a bluish-green tint due to methane absorption, Neptune's vivid blue coloration is attributed to the presence of trace amounts of methane in its atmosphere, which absorbs red light and reflects blue light back into space. Neptune boasts a diverse array of features, including a dynamic atmosphere characterized by powerful storms, such as the famous Great Dark Spot and the smaller, transient storm systems that periodically emerge and dissipate in its turbulent skies. The planet's fast winds, which can reach speeds of up to 2,100 kilometers per hour (1,300 miles per hour), contribute to the formation and dispersion of these atmospheric disturbances.",
    "Image": "images/Neptune.png"
  }
]